[
  {
    "Version" : "1.1.2",
    "Stage" : "Stable Release / No Update Required",
    "Description" : "Unbranded tactics are now supported."
  },
  {
    "Version" : "1.1.1",
    "Stage" : "Functionality for having 'Italicized' Titles has been added.",
    "Description" : "Doximity Platform Headers/Footers have been removed."
  },
  {
    "Version" : "1.1.0",
    "Stage" : "Stable Release / Update Required",
    "Description" : "Doximity Platform Headers/Footers have been removed."
  },
  {
    "Version" : "1.0.0",
    "Stage" : "Stable Release / Update Required",
    "Description" : "Epocrates alerts have been included and ready for use."
  },
  {
    "Version" : "0.3.2",
    "Stage" : "Beta",
    "Description" : "In the 3.2 version, Bug 06-002, Titles not appearing has been fixed. Vaxneuvance Combo has been added to the brand list."
  },
  {
    "Version" : "0.3.1",
    "Stage" : "Beta",
    "Description" : "In the 3.1 version, UI/UX updates include adding click functionality on the left icon buttons, the buttons will now load the corresponding windows. The Brand Drop Down bar is now selectable, not just the icon."
  },
  {
    "Version" : "0.3.0",
    "Stage" : "Beta",
    "Description" : "In the 3.0 version, Tempest is now in it's Beta release. Brands have been added to the Brand List, along with corresponding images. A typo was fixed, 'GARDISIL' has been updated to 'GARDASIL'."
  },
  {
    "Version" : "0.2.1",
    "Stage" : "Testing",
    "Description" : "In the 0.2.1 release, Tempest should now be mapping all interactions correctly and ready for a Full release. The Home button in the template screen now acts as expected, still need to add a functionality that it will automatically 'click' the appropriate Template Type upon reloading the home screen. Will be adding future menu functionality prior to 1.0 release, will need to add all the brands and User Settings, as well as adding a 'Release Notes' menu item."
  },
  {
    "Version" : "0.2.0",
    "Stage" : "Testing",
    "Description" : "In the 0.2.0 release, Tempest is now fully capable of running without pre-loading ApplicationSupports into 'Documents'. Testing is in progress prior to a full update and release. Tempest Splash screen and logo have been added to the Application"
  },
  {
    "Version" : "0.1.5",
    "Stage" : "Testing",
    "Description" : "In the 0.1.5 release, Tempest has been reconfigured to allow running, with ApplicationSupports hard loaded into 'Documents'. Further testing is required before automating this process."
  },
  {
    "Version" : "0.1.0",
    "Stage" : "Initial Build",
    "Description" : "Tempest is an Application for the automating of Doximity / Epocrates templates – replacing the current InDesign version of these templates. Tempest is self containing and has logic in place to handle updates that do not require the re-installation of the Application. Tempest was built by John McCall in 2023."
  }
]